{
  "data": {
    "lesson": {
      "id": 848134,
      "key": "952410cc-5fd8-423f-8fd3-4ec1a9014f46",
      "title": "服务说明 / Service Overview ",
      "semantic_type": "Lesson",
      "is_public": true,
      "version": "1.0.0",
      "locale": "en-us",
      "summary": "本部分包含重要的课程服务说明，请务必仔细阅读后，再展开后续内容学习。 \n",
      "lesson_type": "Classroom",
      "display_workspace_project_only": false,
      "resources": null,
      "project": null,
      "lab": null,
      "concepts": [
        {
          "id": 848148,
          "key": "f5ec8499-d3d0-4df3-8613-ec2256a1e9e4",
          "title": "课程服务与支持 Udacity Service and Support",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "f5ec8499-d3d0-4df3-8613-ec2256a1e9e4",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 848154,
              "key": "7593d311-34cc-40c7-8ee1-b3fa3b62272c",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "## 欢迎加入新的纳米学位之旅！Welcome to Your Udacity Nanodegree Program! \n\n\n相信优秀的你可以凭借优秀的自主学习和自我管理能力，以超高性价比获得同样的知识与技能。为提高学习效率，请仔细阅读以下内容，了解在本纳米学位中，你将获得的学习服务与支持。\n\nFor those with independent learning abilities and self-management skills, you will access world-class curriculum and learn from top industry professionals. To schedule your program reasonally, please read carefully and get well aware of all services and supports available during your term.\n\n## 课程服务 Service\n \n在课程有效期内，我们仍将提供`专家项目审阅（英文）`来帮助你来确认学习结果；本课程将以全英文的形式展开，通过所有必修实战项目后，你可以在教室中完成毕业流程并获得英文版证书。你可以进入 **ND Program Home**（返回上一层）查看学期结束时间。\n\nDuring your term, our **qualified English reviewers** will provide detailed feedback on your submitted projects and help ensure you learn the skills the right way. The program is taught in English. You will need to complete all the lessons and projects in order to receive your graduation certificate in English. Go back to **ND Program Home** to view your term deadline.\n\n## 学习支持 Support\n\n当你遇到问题时，如果它是学习上的问题，我们推荐你充分使用 Google、 Stack Overflow 等搜索引擎或垂直社区；对于其他问题，如果是与账号、课程加入、发票相关的常见问题，你可以先查看我们的[常见问题中心](https://udacity.kf5.com/hc/)，或许可以更快获得答案，也可随时[点击此处](https://udacity.kf5.com/hc/request/new/) 提交工单,与我们服务支持团队取得联系。\n\nIf you have content questions, you may look for answers using web-searching methods like Google or Stack Overflow. You may also try searching in online learning communities. For general inquiries related to account, course access, invoice etc., click [here](https://udacity.kf5.com/hc/request/new/)  to submit a Requset form and our support team will be in touch. You may also view [FAQ](https://udacity.kf5.com/hc) for a quick solution. \n\n\n\n\n#### 期待你顺利毕业！ Looking forward to your graduation!\n\nGo to the next page to learn about terms and conditions related to content access. \n",
              "instructor_notes": ""
            }
          ]
        },
        {
          "id": 848634,
          "key": "e9b1a9f7-af14-48f0-abc5-38841b8db52e",
          "title": "课程保留与维护 Content Access",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "e9b1a9f7-af14-48f0-abc5-38841b8db52e",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 848635,
              "key": "d22107e6-19f1-4f37-a595-1a4ac1d4deff",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "## 课程保留与维护 Content Access\n\n在课程开课后，你需要在规定的时间（课程有效期 + 课程宽限期）内通过全部项目，并完成毕业流程，获得证书，则在课程有效期结束后，自动获得为期12个月的课程视频和文字内容的继续访问权限便于回顾和复习，该期限起算时间为课程有效期结束后次日开始，课程的视频和文字内容为购买时的版本。如果你未能在宽限期届满时达到毕业条件，你将会失去课程内容访问的权限，需要重新付费才能再次加入课程。想要了解更多，请见[官方详细说明](https://udacity.kf5.com/hc/kb/article/1228457/)。\n\nAll projects should be completed by deadline (term period + extension period) before you could receive the graduation certificate. After successful graduation, you will have extended access to a static version of the classroom content of your Nanodegree program for 12 months. The 12-month period starts the day after your applicable Nanodegree program ends. The static content will be the version at the time of your purchase. However, if you fail to graduate by the extension period, you will no longer have access to classroom contents, including its static version. You will have to re-purchase the program before continuing your progress and completing the term. For more information, please visit [here](https://udacity.kf5.com/hc/kb/article/1228457/).\n\n\n## 课程的维护 Content Refresh\n\n在纳米学位课程学习过程中，如果你发现诸如内容错误、翻译不准确、失效链接等问题，可以点击页面右上角“发送课程建议”。课程内容和实战项目以报名时版本为准，优达学城对课程内容和实战项目有最终解释权。\n\nIf you have any comments or notice any errors in your Nanodegree program or course content, you can submit content feedback. Program contents and projects will be the version at the time of your purchase. Udacity reserves the right to amend and not amend course contents and projects.\n",
              "instructor_notes": ""
            },
            {
              "id": 848638,
              "key": "d7ad5da7-b86a-41dc-b103-3379aa93a9b6",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "_后续内容将以全英文形式展开，祝学习愉快！_\n_The subsequent lessons will be taught in English. Get started now and have fun!_",
              "instructor_notes": ""
            }
          ]
        },
        {
          "id": 848135,
          "key": "989842d9-ef4e-49ed-952f-1da8a745beee",
          "title": "Deadline Policy",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "989842d9-ef4e-49ed-952f-1da8a745beee",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 848136,
              "key": "02f5527d-efb7-4575-8d86-30db0df8e6f8",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "# Deadline Policy\n\nThis program is project-based, and each project has a suggested deadline to keep students on pace towards graduation. In addition to the suggested project deadlines, each class has a **term end deadline**, by which date all required projects must be passed in order to successfully complete the course and receive a certificate. To review all the project deadlines and Term deadline for this Nanodegree program, visit your ND Program Home.\n\n\n---\n## Deadlines FAQ\n\n\n#### What is a “suggested deadline”?\nThe “suggested deadlines” are flexible deadlines that are meant to guide students towards graduation and there’s no penalty if you miss the project deadlines we’ve laid out for you. You are welcome to turn in your projects before or after the suggested deadline as long as you turn everything in by the **term end date**.\n\n#### Do I have to turn my projects in by the dates Udacity has laid out?\nNo. The project deadline dates we’ve laid out are suggestions from our team to help keep you on pace to successfully graduate by the end of the Nanodegree term. The date that you should use as your compass is the **term end deadline**. \n\n#### What happens if I don’t complete a project by the date Udacity has laid out?\nNothing. **There is no penalty for missing a suggested project deadline and you can turn projects in at any time (before or after the suggested deadline), as long as it is by your term end deadline**. Although the project deadlines you see are soft deadlines, we highly recommend you try your best to keep up with the suggested deadlines to ensure you can get through the content at a reasonable pace and so all your projects don’t pile up a few weeks before your **term-end deadline**.\n\n#### What do I need to do in order to complete the course?\nStudents must complete and pass all the required projects by the **term-end date** in order to successfully graduate from the program. Passing a project means that a Udacity Reviewer has marked your project as “Meets Specifications.” The project review process can take anywhere between a couple of hours to a couple of days, so please plan accordingly as you turn in your projects towards the end of your term. Your projects must be reviewed and passed by the last day of the term. NOTE: you can submit your project as many times as you need to in order to pass.\n\n#### Can I graduate from the Nanodegree program without completing and passing all the required projects?\nNo, all required projects must be completed and passed in order to receive a Nandodegree certificate. However, the course may have a few extra projects or labs (those not mentioned in the Deadlines calendar), which are solely for your benefit and are not required for graduation.\n\n#### Do I need to wait until the last day of the term in order to graduate?\nNo. Students can graduate from the program at anytime after they complete and pass all the required projects. Once your final project has been passed by a Udacity Reviewer, you will see the option to begin the graduation process.\n\n#### Is the term end date also a suggested deadline?\n**No.** That is the date you should be working towards as the last date you can turn projects in.\n\n#### What happens if I don’t turn all my project in by the term end date?\nIf you do not pass all projects by the last day of the term, you will receive an **automatic and free 4-week extension (no need to write in to support to receive this extension)** to complete any outstanding projects. You will only receive this extension once, so please do not aim to use this extension unless you absolutely need to and certainly do not leave a majority of your projects unattempted until this extension period. \n\n#### Do I need to write in to support to get an extension, should I need it?\nNo. You will automatically receive a free 4-week extension if you don’t complete and pass all the required projects by the **term end date**. \n\n#### What are my options if I still don’t complete all the required projects within the 4-week extension?\nIf you do not complete the term within the extension period, you will be removed from the program and will no longer be able to access course content. To resume access to the course, you would need to re-enroll in a new term and pay the associated enrollment fees again. However, your course progress will carry over to the new term, so you will be able to continue where you left off.",
              "instructor_notes": ""
            }
          ]
        },
        {
          "id": 848137,
          "key": "613d3896-e6b6-4102-aca7-f6b17683ef3c",
          "title": "Community Guidelines",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "613d3896-e6b6-4102-aca7-f6b17683ef3c",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 848138,
              "key": "52d856a5-327a-42cc-856e-a3371ef160de",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "# Community Guidelines\n\nYour experience in the Nanodegree program and community should be an engaging, fulfilling, and positive one. As such, we have outlined the following system for reporting behavior that does not live up to Udacity’s standards, so it can quickly be addressed by our staff. \n\nAll reports of suspected violations to the [TOU](https://www.udacity.com/legal/terms-of-service), [Community Code of Conduct](https://www.udacity.com/legal/community-guidelines) or [Honor Code](https://www.udacity.com/legal/community-guidelines) should be submitted to report@udacity.com  and will be reviewed. If you witness or are experiencing any violations of our policies please get in touch with us. Below prohibited actions as set forth on our [Community Code of Conduct](https://www.udacity.com/legal/community-guidelines):\n\n- **Harassment:** Inappropriate, harassing, abusive, discriminatory, derogatory or violent comments or conduct. \n- **Discrimination:** Offensive comments related to gender or gender identity, sexual orientation, race, ethnicity, religion, national origin, disability or disease\n- **Distributing inappropriate content:** Use of sexual, violent, graphic, or derogatory images\n- **Bullying:** Deliberate intimidation, threats of violence or violent language directed against another person\n- **Sexual harassment:** Unwelcome sexual attention \n- **Defamation:** Obscene, fraudulent, indecent, or libelous acts that defame, abuse, harass, discriminate against or threaten others\n- **Plagiarism:** will not cheat on any homework assignment, projects or exams for the Online Courses and, specifically, will not plagiarize materials created by others\n- **Self-injury or Suicide:** We do not encourage community postings community forums related to self-injury or suicide. If you or someone you know is exhibiting signs of self-injury or suicide, find help at the [Suicide Prevention Lifeline](https://suicidepreventionlifeline.org/) in the U.S. and [Befrienders.org](https://www.befrienders.org/) globally. \n\nWhen a potential violation is brought to our attention, we will make every effort to investigate the case thoroughly and make a decision that is fair to all parties.\n\nThank you, \nThe Udacity Team\n",
              "instructor_notes": ""
            }
          ]
        },
        {
          "id": 848629,
          "key": "11869b2e-b610-4302-8f34-439746b3a703",
          "title": "Learning Strategies",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "11869b2e-b610-4302-8f34-439746b3a703",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 848630,
              "key": "0c82a8db-c6ab-444b-992e-e63085b6e96d",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "## Learning Strategies \n\nDigging in and wrestling with the material is crucial to gaining a deep understanding of the material and retaining it in your long-term memory.\n\nResearch shows that we gain a deeper understanding of what we've learned when we explain it to someone else. After learning a certain concept and before going to the next lecture, try summarizing the concept in your head. Imagine that you’re trying to explain it to someone...or better yet go and actually explain it to someone! You can do this in person, on a video call with a friend, or you can share your insights with your fellow learners right in the classroom!\n\nTry out these strategies to improve your understanding and your retention of newly learned material:\n\n1. Ask yourself follow-up questions about the material. Here's an example: \"If I changed X in the example, would the code still work? How would it change?\"\n\n* Connect the new information to something you already know. In which ways are the two similar? How are they different?\n\n* Draw out the information in a visual form. Share your diagrams, visual models, or flowcharts.\n\n\nThese strategies will help you gain a deeper understanding of the material, help your classmates learn the material, and have a lot of fun while learning!\n",
              "instructor_notes": ""
            }
          ]
        }
      ]
    }
  }
}